Revit 2026 API

# IFCOpeningData Methods

---

The IFCOpeningData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExtrusionData | Gets extrusion data. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOpeningSolids | Gets opening solids. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCOpeningData Class

Autodesk.Revit.DB.IFC Namespace